# Project 3 Part 4 - Hypothesis Testing
Cameron Peace

## Task

For part 4 of the project, you will be using your MySQL database from part 3 to answer meaningful questions for your stakeholder. They want you to use your hypothesis testing and statistics knowledge to answer 3 questions about what makes a successful movie.

**Questions to Answer:**

*The stakeholder's first question is: does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?*

* [ ] They want you to perform a statistical test to get a mathematically-supported answer.
* [ ] They want you to report if you found a significant difference between ratings.
* [ ] If so, what was the p-value of your analysis?
* [ ] And which rating earns the most revenue?
* [ ] They want you to prepare a visualization that supports your finding.

It is then up to you to think of 2 additional hypotheses to test that your stakeholder may want to know.
* [ ] Hypothesis 1
* [ ] Hypothesis 2

Some example hypotheses you could test:

* Do movies that are over 2.5 hours long earn more revenue than movies that are 1.5 hours long (or less)?
* Do movies released in 2020 earn less revenue than movies released in 2018?
* How do the years compare for movie ratings?
* Do some movie genres earn more revenue than others?
* Are some genres higher rated than others?
etc.

Specifications

Your Data

* A critical first step for this assignment will be to retrieve additional movie data to add to your SQL database.
* You will want to use the TMDB API again and extract data for additional years.
* You may want to review the optional lesson from Week 1 on "Using glob to Load Many Files" to load and combine all of your API results for each year.
* However, trying to extract the TMDB data for all movies from 2000-2022 could take >24 hours!
* To address this issue, you should EITHER:
* Define a smaller (but logical) period of time to use for your analyses (e.g. last 10 years, 2010-2019 (pre-pandemic, etc).
* OR coordinate with cohort-mates and divide the API calls so that you can all download the data for a smaller number of years and then share your downloaded JSON data.


**Deliverables:**

* [ ] You should use the same project repository you have been using for Parts 1-3 (for your portfolio).
* [ ] Create a new notebook in your project repository just for the hypothesis testing (like "Part 4 - Hypothesis Testing.ipynb")
* [ ] Make sure the results and visualization for all 3 hypotheses are in your notebook.
* [ ] Please submit the link to your GitHub repository for this assignment.

## Data Background

The following movie dataset contains movies released in the United States during the time period 2000-2022. It has been built using datasets available via [imdb](https://www.imdb.com/interfaces/) and data gathered via API from [tmdb](https://www.themoviedb.org/?language=en-US) Please see the previous sections of the project for more details.

## Imports

In [30]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
# SQL
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
# Stats
import scipy.stats as stats
import statsmodels.api as sm

## Connecting to Database

In [2]:
# loading password
with open('Data/sqlpass.txt') as f:
    my_pass = f.read()

In [3]:
# creating engine
engine = create_engine(f'mysql+pymysql://root:{my_pass}@localhost/movies')

# verifying
engine

Engine(mysql+pymysql://root:***@localhost/movies)

In [4]:
# displaying tables
pd.read_sql('show tables', engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data

## Loading, Viewing Data

In [5]:
# loading in tables as dataframes
genres = pd.read_sql('select * from genres', engine)
title_basics = pd.read_sql('select * from title_basics', engine)
title_genres = pd.read_sql('select * from title_genres', engine)
title_ratings = pd.read_sql('select * from title_ratings', engine)
tmdb_data = pd.read_sql('select * from tmdb_data', engine)

In [6]:
# initial view of dfs
display(genres.sample(3), title_basics.sample(3), title_genres.sample(3), 
        title_ratings.sample(3), tmdb_data.sample(3))

   genre_name  genre_id
20      Short        20
21      Sport        21
0      Action         0

          tconst    primary_title  start_year  runtime_minutes
33249  tt1538840         Mavi Goz      2003.0               56
34707  tt1588170  I Saw the Devil      2010.0              144
73941  tt6408226          Newness      2017.0              117

           tconst  genre_id
69336   tt1701992         8
81091   tt2057392         0
123941  tt4860100         7

           tconst  average_rating  num_votes
399862  tt3829498             7.4         25
416061  tt4693830             8.3         20
196869  tt0747056             7.9         22

         imdb_id  revenue  budget certification
45905  tt3840608      0.0     0.0
29712  tt1730312      0.0     0.0
60612  tt7823906      0.0     0.0          None

## ***Question 1:***

<font color='dodgerblue' size=4><i>
Does the MPAA rating of a movie (G/PG/PG-13/R) affect how much revenue the movie generates?
</i></font>

### Hypothesis Statements + Alpha Value



**Null Hypothesis($H_0$):**

<font color='forestgreen' size=4>The given rating of a movie has ***no significant effect*** on its revenue
</font>

**Alternate Hypothesis($H_1$):**
    
<font color='forestgreen' size=4>The given rating of a movie ***has a significant effect*** on its revenue
</font>

**Alpha Value:**

<font color='forestgreen' size=4>
0.05
</font>

### Statistical Test and Assumptions

<font color='dodgerblue' size=4><i>
Because we are dealing with more than 2 categories/groups with a single numerical variable (revenue), we will use a one way ANOVA test to determine significant differences between the average revenues.  In order to perform the test, our data needs to meet 3 assumptions: No significant outliers, equal variance between groups and normality of distributions.
</i></font>

In [7]:
# taking another look at the data
display(tmdb_data.sample(3), tmdb_data.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65850 entries, 0 to 65849
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        65850 non-null  object
 1   revenue        65849 non-null  float64
 2   budget         65849 non-null  float64
 3   certification  39183 non-null  object
dtypes: float64(2), object(2)
memory usage: 2.0+ MB

         imdb_id  revenue  budget certification
62181  tt8404624      0.0     0.0
60514  tt7776838      0.0     0.0          None
39058  tt2556674      0.0     0.0          None

None

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
It appears that we have many missing values both in 'certification' and in 'revenue'.
</i></font>

### Data Cleaning

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
I'm making the call here that movies with zeros for both revenue and budget are likely movies that did not get made or are missing data.  Also, movies with revenue but no budget data likely mistakes so they will be removed.  However, I do find it plausible that movies only missing revenue could simply be 'flops' (i.e. that did not make back their costs), so I'm leaving these entries in.  There are assumptions being made here that would ideally be checked with a subject matter expert, but I believed the underlying rationale is sound.
</i></font>

#### Dropping NaNs

In [8]:
# checking for NaNs
tmdb_data.isna().sum()

imdb_id              0
revenue              1
budget               1
certification    26667
dtype: int64

In [9]:
# dropping NaNs
tmdb_data = tmdb_data.dropna().copy()

# checking
tmdb_data.isna().sum()

imdb_id          0
revenue          0
budget           0
certification    0
dtype: int64

#### Dropping movies missing 'revenue' or 'budget' data

In [10]:
# viewing shape before filtering
print(tmdb_data.shape)
# dropping movies with zero for both 'revenue' AND 'budget'
tmdb_data = tmdb_data[((tmdb_data['revenue'] > 0) & (tmdb_data['budget'] > 0)) |
                     ((tmdb_data['revenue'] == 0) & (tmdb_data['budget'] > 0))].copy()

print(tmdb_data.shape)

(39183, 4)
(9593, 4)

In [11]:
# confirming changes
display(tmdb_data[(tmdb_data['revenue'] > 0) & (tmdb_data['budget'] == 0)],
        tmdb_data[(tmdb_data['revenue'] == 0) & (tmdb_data['budget'] == 0)],
       tmdb_data[(tmdb_data['revenue'] == 0) & (tmdb_data['budget'] > 0)].head())

Empty DataFrame
Columns: [imdb_id, revenue, budget, certification]
Index: []

Empty DataFrame
Columns: [imdb_id, revenue, budget, certification]
Index: []

      imdb_id  revenue      budget certification
3   tt0069049      0.0  12000000.0             R
4   tt0088751      0.0    350000.0
8   tt0113026      0.0  10000000.0
15  tt0118652      0.0   1000000.0             R
21  tt0119273      0.0  15000000.0             R

#### Removing movies missing 'certification' data

In [12]:
# checking data
tmdb_data['certification'].value_counts()

           3298
R          2699
PG-13      1799
NR          925
PG          712
G           125
NC-17        34
Unrated       1
Name: certification, dtype: int64

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
We have a certain subset of our movie data where the 'certification' is just blank (i.e. not a NaN value).  I'm removing this entries, as well as the 1 'Unrated' entry since it's too small of a sample to work with.
</i></font>

In [13]:
# removing blank 'certification' and "Unrated" value
tmdb_data = tmdb_data[(tmdb_data['certification'] != '') & (tmdb_data['certification'] != 'Unrated')].copy()

# checking
display(tmdb_data.certification.value_counts(), tmdb_data.shape)

R        2699
PG-13    1799
NR        925
PG        712
G         125
NC-17      34
Name: certification, dtype: int64

(6294, 4)

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
We've take quite a few movies out of this dataset but we're still left with a sample size of nearly 6300 movies to work with
</i></font>

### Separating 'Certification' groups

In [18]:
# separating
r = tmdb_data[tmdb_data['certification'] == 'R'].copy()
pg13 = tmdb_data[tmdb_data['certification'] == 'PG-13'].copy()
nr = tmdb_data[tmdb_data['certification'] == 'NR'].copy()
pg = tmdb_data[tmdb_data['certification'] == 'PG'].copy()
g = tmdb_data[tmdb_data['certification'] == 'G'].copy()
nc17 = tmdb_data[tmdb_data['certification'] == 'NC-17'].copy()

# checking
print('R:', r.shape, 'PG-13:', pg13.shape, 'NR:', nr.shape, 
      'PG:', pg.shape, 'G:', g.shape, 'NC-17:', nc17.shape)

R: (2699, 4) PG-13: (1799, 4) NR: (925, 4) PG: (712, 4) G: (125, 4) NC-17: (34, 4)

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
It looks like everything was separated correctly, the value counts match
</i></font>

### Checking For and Removing Outliers

In [19]:
# creating a zscore column with calculation
r['zscore'] = stats.zscore(r['revenue'])
pg13['zscore'] = stats.zscore(pg13['revenue'])
nr['zscore'] = stats.zscore(nr['revenue'])
pg['zscore'] = stats.zscore(pg['revenue'])
g['zscore'] = stats.zscore(g['revenue'])
nc17['zscore'] = stats.zscore(nc17['revenue'])

# checking
r.head()

      imdb_id     revenue      budget certification    zscore
3   tt0069049         0.0  12000000.0             R -0.449036
15  tt0118652         0.0   1000000.0             R -0.449036
21  tt0119273         0.0  15000000.0             R -0.449036
30  tt0120467     14904.0    120000.0             R -0.448855
37  tt0120679  56298500.0  12000000.0             R  0.234299

In [22]:
# checking for outliers
print('R ', len(r[abs(r['zscore']) > 3]), '\n'
'PG-13 ', len(pg13[abs(pg13['zscore']) > 3]), '\n'
'NR ', len(nr[abs(nr['zscore']) > 3]), '\n'
'PG ', len(pg[abs(pg['zscore']) > 3]), '\n'
'G ', len(g[abs(g['zscore']) > 3]), '\n'
'NC-17 ', len(nc17[abs(nc17['zscore']) > 3]))

R  60
PG-13  41
NR  14
PG  22
G  3
NC-17  1

In [23]:
# printing shape to check values against to confirm changes
print('R:', r.shape, 'PG-13:', pg13.shape, 'NR:', nr.shape, 
      'PG:', pg.shape, 'G:', g.shape, 'NC-17:', nc17.shape)

# removing outliers
r = r[abs(r['zscore'] < 3)].copy()
pg13 = pg13[abs(pg13['zscore'] < 3)].copy()
nr = nr[abs(nr['zscore'] < 3)].copy()
pg = pg[abs(pg['zscore'] < 3)].copy()
g = g[abs(g['zscore'] < 3)].copy()
nc17 = nc17[abs(nc17['zscore'] < 3)].copy()

# confirming
print('R:', r.shape, 'PG-13:', pg13.shape, 'NR:', nr.shape, 
      'PG:', pg.shape, 'G:', g.shape, 'NC-17:', nc17.shape)

print('R ', len(r[abs(r['zscore']) > 3]), '\n'
'PG-13 ', len(pg13[abs(pg13['zscore']) > 3]), '\n'
'NR ', len(nr[abs(nr['zscore']) > 3]), '\n'
'PG ', len(pg[abs(pg['zscore']) > 3]), '\n'
'G ', len(g[abs(g['zscore']) > 3]), '\n'
'NC-17 ', len(nc17[abs(nc17['zscore']) > 3]))

R: (2699, 5) PG-13: (1799, 5) NR: (925, 5) PG: (712, 5) G: (125, 5) NC-17: (34, 5)
R: (2639, 5) PG-13: (1758, 5) NR: (911, 5) PG: (690, 5) G: (122, 5) NC-17: (33, 5)
R  0
PG-13  0
NR  0
PG  0
G  0
NC-17  0

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
It looks like we have successfully removed outliers from each group
</i></font>

### Checking for Normality

In [25]:
# checking each group for normality of distribution
print('R ', stats.normaltest(r['revenue']), '\n'
'PG-13 ', stats.normaltest(pg13['revenue']), '\n'
'NR ', stats.normaltest(nr['revenue']), '\n'
'PG ', stats.normaltest(pg['revenue']), '\n'
'G ', stats.normaltest(g['revenue']), '\n'
'NC-17 ', stats.normaltest(nc17['revenue']))

R  NormaltestResult(statistic=1311.114748570066, pvalue=1.9726488199533083e-285)
PG-13  NormaltestResult(statistic=909.7708954906104, pvalue=2.791001989876708e-198)
NR  NormaltestResult(statistic=1081.509266408404, pvalue=1.4231370846065904e-235)
PG  NormaltestResult(statistic=284.96055536076074, pvalue=1.3231272788776703e-62)
G  NormaltestResult(statistic=55.75823741142433, pvalue=7.802837918358882e-13)
NC-17  NormaltestResult(statistic=58.583189582670215, pvalue=1.9002993332652503e-13)

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
All of our p-values are below 0.05 for the D'Agostino-Pearson normality test so we our distributions are ***NOT*** normal.  However, because each group has an n value higher than 15, we can still proceed with the ANOVA test
</i></font>

### Checking for Equality of Variance

In [26]:
# checking the variance
print(stats.levene(r['revenue'], pg13['revenue'], nr['revenue'], 
                   pg['revenue'], g['revenue'], nc17['revenue']))

LeveneResult(statistic=180.80888445771356, pvalue=4.176643788379298e-180)

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
Our p-value was below 0.05 so our variances are ***NOT** equal, we'll shift from using an ANOVA test to a non-parametric Kruskal-Wallis ANOVA test.
</i></font>

### Kruskal-Wallis Test

In [27]:
# running the test
print(stats.kruskal(r['revenue'], pg13['revenue'], nr['revenue'], 
                   pg['revenue'], g['revenue'], nc17['revenue']))

KruskalResult(statistic=1495.182032857619, pvalue=0.0)

<mark><u>**Comment:**</u>

<font color='dodgerblue' size=4><i>
We have a p-value below our alpha of 0.05 (p-value = 0.0), which tells us that a movie's rating does effect its revenue.
</i></font>

### Data Viz #1: Rating vs Revenue

In [36]:
sm.stats.multicomp.pairwise_tukeyhsd([r, pg13, nr, pg, g, nc17], groups='certification')

ValueError: data has 6 elements and groups has 13